## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.helloWorldApp.azurerm_container_app.helloWorld[0] must be replaced
-/+ resource "azurerm_container_app" "helloWorld" {
      ~ container_app_environment_id  = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.App/managedEnvironments/cae-erictfpoc-dev-eus" -> (known after apply) # forces replacement
      ~ custom_domain_verification_id = (sensitive value)
      ~ id                            = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.App/containerApps/ca-hello-world" -> (known after apply)
      ~ latest_revision_fqdn          = "ca-hello-world--cmb71cx.happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply)
      ~ latest_revision_name          = "ca-hello-world--cmb71cx" -> (known after apply)
      ~ location                      = "eastus" -> (known after apply)
        name                          = "ca-hello-world"
      ~ outbound_ip_addresses         = [] -> (known after apply)
      - tags                          = {} -> null
        # (3 unchanged attributes hidden)

      ~ identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ ingress {
          ~ custom_domain              = [] -> (known after apply)
          - exposed_port               = 0 -> null
          ~ fqdn                       = "ca-hello-world.happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ template {
          + revision_suffix = (known after apply)
            # (2 unchanged attributes hidden)

          ~ container {
              - args              = [] -> null
              - command           = [] -> null
              ~ ephemeral_storage = "1Gi" -> (known after apply)
                name              = "simple-hello"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.hub.azurerm_resource_group.hubResourceGroup will be updated in-place
  ~ resource "azurerm_resource_group" "hubResourceGroup" {
        id         = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-hub-dev-eus"
        name       = "rg-erictfpoc-hub-dev-eus"
      ~ tags       = {
          - "CreationDate"   = "10/16/2024" -> null
          - "Creator"        = "3b694c14-9fd4-4721-8735-69354fd83d54" -> null
          - "ExpirationDate" = "10/30/2024" -> null
          - "Owner"          = "3b694c14-9fd4-4721-8735-69354fd83d54" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # module.spoke.data.azurerm_subnet.appGatewaySubnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "appGatewaySubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-agw"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.data.azurerm_subnet.infraSubnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "infraSubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-infra"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.data.azurerm_subnet.jumpboxSubnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "jumpboxSubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-jumpbox"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.data.azurerm_subnet.privateEndpointsSubnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "privateEndpointsSubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-pep"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-erictfpoc-spoke-dev-eus"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-erictfpoc-dev-eus-spoke"
    }

  # module.spoke.azurerm_resource_group.spokeResourceGroup will be updated in-place
  ~ resource "azurerm_resource_group" "spokeResourceGroup" {
        id         = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus"
        name       = "rg-erictfpoc-spoke-dev-eus"
      ~ tags       = {
          - "CreationDate"   = "10/16/2024" -> null
          - "Creator"        = "3b694c14-9fd4-4721-8735-69354fd83d54" -> null
          - "ExpirationDate" = "10/30/2024" -> null
          - "Owner"          = "3b694c14-9fd4-4721-8735-69354fd83d54" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # module.spoke.azurerm_subnet_network_security_group_association.agwSecurityGroupAssociation[0] must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "agwSecurityGroupAssociation" {
      ~ id                        = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-agw" -> (known after apply)
      ~ subnet_id                 = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-agw" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.spoke.azurerm_subnet_network_security_group_association.infraSecurityGroupAssociation must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "infraSecurityGroupAssociation" {
      ~ id                        = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-infra" -> (known after apply)
      ~ subnet_id                 = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-infra" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.spoke.azurerm_subnet_network_security_group_association.jumpBoxSecurityGroupAssociation[0] must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "jumpBoxSecurityGroupAssociation" {
      ~ id                        = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-jumpbox" -> (known after apply)
      ~ subnet_id                 = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-jumpbox" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.spoke.azurerm_subnet_network_security_group_association.privateEndpointSecurityGroupAssociation must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "privateEndpointSecurityGroupAssociation" {
      ~ id                        = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-pep" -> (known after apply)
      ~ subnet_id                 = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-pep" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.applicationGateway.module.appGatewayConfiguration.azurerm_application_gateway.appGateway will be updated in-place
  ~ resource "azurerm_application_gateway" "appGateway" {
        id                                = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/applicationGateways/agw-erictfpoc-dev-eus"
        name                              = "agw-erictfpoc-dev-eus"
        tags                              = {}
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [
              - "ca-hello-world--cmb71cx.happybush-62ea2df9.eastus.azurecontainerapps.io",
            ] -> null
          - id           = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/applicationGateways/agw-erictfpoc-dev-eus/backendAddressPools/acaServiceBackend" -> null
          - ip_addresses = [] -> null
          - name         = "acaServiceBackend" -> null
        }
      + backend_address_pool {
          + fqdns        = (known after apply)
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "acaServiceBackend"
        }

      ~ gateway_ip_configuration {
            id        = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/applicationGateways/agw-erictfpoc-dev-eus/gatewayIPConfigurations/appGatewayIpConfig"
            name      = "appGatewayIpConfig"
          ~ subnet_id = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-agw" -> (known after apply)
        }

      - probe {
          - host                                      = "ca-hello-world--cmb71cx.happybush-62ea2df9.eastus.azurecontainerapps.io" -> null
          - id                                        = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/applicationGateways/agw-erictfpoc-dev-eus/probes/webProbe" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "webProbe" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Https" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [
                  - "200-499",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + host                                      = (known after apply)
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "webProbe"
          + path                                      = "/"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-499",
                ]
                # (1 unchanged attribute hidden)
            }
        }

        # (11 unchanged blocks hidden)
    }

  # module.containerAppsEnvironment.module.containerAppsEnvironment.azurerm_container_app_environment.environment must be replaced
-/+ resource "azurerm_container_app_environment" "environment" {
      ~ custom_domain_verification_id               = "72B739084476D059AE2F3A6D071F57C7950AA74F8203AE7837F59C267C972894" -> (known after apply)
      ~ default_domain                              = "happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      ~ id                                          = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.App/managedEnvironments/cae-erictfpoc-dev-eus" -> (known after apply)
      - infrastructure_resource_group_name          = "ME_cae-erictfpoc-dev-eus_rg-erictfpoc-spoke-dev-eus_eastus" -> null
      ~ infrastructure_subnet_id                    = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-infra" -> (known after apply) # forces replacement
        name                                        = "cae-erictfpoc-dev-eus"
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      ~ static_ip_address                           = "10.1.0.22" -> (known after apply)
      - tags                                        = {} -> null
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.containerAppsEnvironment.module.containerAppsEnvironmentPrivateDnsZone.azurerm_private_dns_a_record.aRecords["*"] must be replaced
-/+ resource "azurerm_private_dns_a_record" "aRecords" {
      ~ fqdn                = "*.happybush-62ea2df9.eastus.azurecontainerapps.io." -> (known after apply)
      ~ id                  = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-hub-dev-eus/providers/Microsoft.Network/privateDnsZones/happybush-62ea2df9.eastus.azurecontainerapps.io/A/*" -> (known after apply)
        name                = "*"
      ~ records             = [
          - "10.1.0.22",
        ] -> (known after apply)
      - tags                = {} -> null
      ~ zone_name           = "happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.containerAppsEnvironment.module.containerAppsEnvironmentPrivateDnsZone.azurerm_private_dns_zone.privDnsZone must be replaced
-/+ resource "azurerm_private_dns_zone" "privDnsZone" {
      ~ id                                                    = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-hub-dev-eus/providers/Microsoft.Network/privateDnsZones/happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply)
      ~ max_number_of_record_sets                             = 25000 -> (known after apply)
      ~ max_number_of_virtual_network_links                   = 1000 -> (known after apply)
      ~ max_number_of_virtual_network_links_with_registration = 100 -> (known after apply)
      ~ name                                                  = "happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply) # forces replacement
      ~ number_of_record_sets                                 = 2 -> (known after apply)
      - tags                                                  = {} -> null
        # (1 unchanged attribute hidden)

      ~ soa_record (known after apply)
      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "happybush-62ea2df9.eastus.azurecontainerapps.io." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.containerAppsEnvironment.module.containerAppsEnvironmentPrivateDnsZone.azurerm_private_dns_zone_virtual_network_link.link["vnet-dev-eus-hub"] must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "link" {
      ~ id                    = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-hub-dev-eus/providers/Microsoft.Network/privateDnsZones/happybush-62ea2df9.eastus.azurecontainerapps.io/virtualNetworkLinks/vnet-dev-eus-hub-link" -> (known after apply)
        name                  = "vnet-dev-eus-hub-link"
      ~ private_dns_zone_name = "happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply) # forces replacement
      - tags                  = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.containerAppsEnvironment.module.containerAppsEnvironmentPrivateDnsZone.azurerm_private_dns_zone_virtual_network_link.link["vnet-erictfpoc-dev-eus-spoke"] must be replaced
-/+ resource "azurerm_private_dns_zone_virtual_network_link" "link" {
      ~ id                    = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-hub-dev-eus/providers/Microsoft.Network/privateDnsZones/happybush-62ea2df9.eastus.azurecontainerapps.io/virtualNetworkLinks/vnet-erictfpoc-dev-eus-spoke-link" -> (known after apply)
        name                  = "vnet-erictfpoc-dev-eus-spoke-link"
      ~ private_dns_zone_name = "happybush-62ea2df9.eastus.azurecontainerapps.io" -> (known after apply) # forces replacement
      - tags                  = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.serviceBus.module.serviceBus.azurerm_servicebus_namespace.sb will be created
  + resource "azurerm_servicebus_namespace" "sb" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "eastus"
      + minimum_tls_version                 = "1.2"
      + name                                = "pocnamespace"
      + premium_messaging_partitions        = 0
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-erictfpoc-spoke-dev-eus"
      + sku                                 = "Standard"

      + network_rule_set (known after apply)
    }

  # module.serviceBus.module.serviceBus.azurerm_servicebus_subscription.sbSubscription[0] will be created
  + resource "azurerm_servicebus_subscription" "sbSubscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "poc-subscription"
      + status                                    = "Active"
      + topic_id                                  = (known after apply)
    }

  # module.serviceBus.module.serviceBus.azurerm_servicebus_topic.sbTopic will be created
  + resource "azurerm_servicebus_topic" "sbTopic" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + id                                      = (known after apply)
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "poc-topic"
      + namespace_id                            = (known after apply)
      + status                                  = "Active"
    }

  # module.spoke.module.routeTable.azurerm_subnet_route_table_association.associationRtSubnetInfra must be replaced
-/+ resource "azurerm_subnet_route_table_association" "associationRtSubnetInfra" {
      ~ id             = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-infra" -> (known after apply)
      ~ subnet_id      = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-infra" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.spoke.module.vm.azurerm_network_interface.vmNic will be updated in-place
  ~ resource "azurerm_network_interface" "vmNic" {
        id                             = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/networkInterfaces/nic-vm-dev-eus"
        name                           = "nic-vm-dev-eus"
        tags                           = {}
        # (15 unchanged attributes hidden)

      ~ ip_configuration {
            name                                               = "ipconfig1"
          ~ subnet_id                                          = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-jumpbox" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

  # module.supportingServices.module.containerRegistry.module.containerRegistryPrivateEndpoints.azurerm_private_endpoint.pe must be replaced
-/+ resource "azurerm_private_endpoint" "pe" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/privateEndpoints/pep-crerictfpocg8qowdeveus" -> (known after apply)
        name                          = "pep-crerictfpocg8qowdeveus"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/networkInterfaces/pep-crerictfpocg8qowdeveus.nic.82ad82bf-e354-4fdc-82d4-1242f8605e4e"
              - name = "pep-crerictfpocg8qowdeveus.nic.82ad82bf-e354-4fdc-82d4-1242f8605e4e"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/privateEndpoints/pep-crerictfpocg8qowdeveus/privateDnsZoneGroups/config1/privateDnsZoneConfigs/privatelink.azurecr.io"
              - name                = "privatelink.azurecr.io"
              - private_dns_zone_id = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-hub-dev-eus/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io"
              - record_sets         = [
                  - {
                      - fqdn         = "crerictfpocg8qowdeveus.eastus.data.privatelink.azurecr.io"
                      - ip_addresses = [
                          - "10.1.2.5",
                        ]
                      - name         = "crerictfpocg8qowdeveus.eastus.data"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "crerictfpocg8qowdeveus.privatelink.azurecr.io"
                      - ip_addresses = [
                          - "10.1.2.6",
                        ]
                      - name         = "crerictfpocg8qowdeveus"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ subnet_id                     = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-pep" -> (known after apply) # forces replacement
      - tags                          = {} -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/privateEndpoints/pep-crerictfpocg8qowdeveus/privateDnsZoneGroups/config1" -> (known after apply)
            name                 = "config1"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "plc"
          ~ private_ip_address                = "10.1.2.5" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.supportingServices.module.keyVault.module.keyVaultPrivateEndpoints.azurerm_private_endpoint.pe must be replaced
-/+ resource "azurerm_private_endpoint" "pe" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/privateEndpoints/pep-kv-erictfpoc-G8qow-dev-eus" -> (known after apply)
        name                          = "pep-kv-erictfpoc-G8qow-dev-eus"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/networkInterfaces/pep-kv-erictfpoc-G8qow-dev-eus.nic.daecc581-6132-4da3-b7be-be696f8855f3"
              - name = "pep-kv-erictfpoc-G8qow-dev-eus.nic.daecc581-6132-4da3-b7be-be696f8855f3"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/privateEndpoints/pep-kv-erictfpoc-G8qow-dev-eus/privateDnsZoneGroups/config1/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              - name                = "privatelink.vaultcore.azure.net"
              - private_dns_zone_id = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-hub-dev-eus/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "kv-erictfpoc-g8qow-dev-e.privatelink.vaultcore.azure.net"
                      - ip_addresses = [
                          - "10.1.2.4",
                        ]
                      - name         = "kv-erictfpoc-g8qow-dev-e"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ subnet_id                     = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/virtualNetworks/vnet-erictfpoc-dev-eus-spoke/subnets/snet-pep" -> (known after apply) # forces replacement
      - tags                          = {} -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/d5736eb1-f851-4ec3-a2c5-ac8d84d029e2/resourceGroups/rg-erictfpoc-spoke-dev-eus/providers/Microsoft.Network/privateEndpoints/pep-kv-erictfpoc-G8qow-dev-eus/privateDnsZoneGroups/config1" -> (known after apply)
            name                 = "config1"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "plc"
          ~ private_ip_address                = "10.1.2.4" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

Plan: 16 to add, 4 to change, 13 to destroy.
```
</details>